app/controllers/chatroom_controller.rb

  def index
    @message = Message.new
    @messages = Message.all.order(id: :desc).limit 3
---
SELECT  "messages".* FROM "messages" ORDER BY "messages"."id" DESC LIMIT ?  [["LIMIT", 3]]